from subcategories_keywords import subcategories_keywords

categories_keywords = {
            'เนื้อสัตว์': ['ไก่','วัว','เป็ด','เนื้อ','หอย','หมึก','แกะ','ปลา','กุ้ง','meat', 'pork', 'beef', 'chicken', 'crayfish', 'duck', 'egg', 'fish', 'lamb', 'offal', 'shellfish', 'shrimp', 'squid','สันคอ', 'ซี่โครง', 'เนื้อสันนอก', 'เนื้อสันใน', 'เนื้อสะโพก', 'เนื้อน่อง', 'เนื้อติดหน้าอก', 'เนื้อติดดับขา', 'เนื้อส่วนหน้าท้อง', 'หาง', 'ปีกบน', 'น่องเล็ก', 'ปีกกลาง', 'ปีกปลาย', 'ขาไก่', 'สะโพกไก่', 'อกไก่', 'สันในไก่', 'น่องไก่', 'สะโพกไก่', 'ไก่ทั้งตัว', 'หนังไก่','ปูจั๊กจั่น', 'ปูทะเล', 'ปูแสม', 'ปูทองหลาง', 'ปูชัก', 'ปูดำ', 'ปูนา', 'ปูม้า', 'ปูทะเล', 'ปูไข่', 'ปูนิ่ม', 'ปูอลาสก้า', 'ปูขน', 'กั้ง', 'ไข่', 'ปลาสวาย', 'ปลาดุก', 'ปลาช่อน', 'ปลากระพง', 'ปลาสลิด', 'ปลาอินทรี', 'ปลาทู', 'ปลานิล', 'ปลาเก๋า', 'ปลาทับทิม', 'ปลาจะละเม็ดขาว', 'ปลาทูน่า', 'ปลาแซลม่อน', 'ปลาฉลาด', 'ปลาไหล', 'ปลาซิว', 'ปลาสำลี', 'ปลาสวาย', 'ปลากราย', 'ปลาตะเพียน', 'ปลาเนื้ออ่อน', 'ปลาหมอ', 'ตับหมู', 'หัวใจหมู', 'กระเพาะหมู', 'ปอดหมู', 'ไส้อ่อนหมู', 'ไส้ตันหมู', 'เซี้ยงจี้', 'ม้าม', 'กระเพาะวัว', 'ผ้าขี้ริ้ว', 'เลือดหมู', 'กึ๋นไก่', 'ตูดไก่', 'ตับไก่','หอยนางรม', 'หอยแมลงภู่', 'หอยแครง', 'หอยลอย', 'หอยหวาน', 'หอยหลอด', 'หอยตลับ', 'หอยเชลล์', 'หอยหมาก', 'หอยขม', 'หอยโข่ง', 'หอยเชอรี่', 'หอยเป๋าฮื้อ', 'หอยเม่น', 'หมึกล้วย', 'หมึกหอม', 'หมึกกระดอง', 'หมึกสาย', 'หมึกกระตอย', 'หมึกสาย', 'หมึกทาโกะ','กุ้งขาว', 'กุ้งแชบ๊วย', 'กุ้งโอคัก', 'กุ้งกุลาดำ', 'กุ้งลายเสือ', 'กุ้งก้ามกราม', 'กุ้งแม่น้ำ', 'กุ้งมังกร', 'กุ้งล็อบสเตอร์', 'กุ้งฝอย', 'ปีกบน', 'น่องเล็ก', 'ปีกกลาง', 'ปีกปลาย', 'ขาเป็ด', 'สะโพกเป็ด', 'อกเป็ด', 'สันในเป็ด', 'น่องเป็ด', 'สะโพกเป็ด', 'เป็ดทั้งตัว', 'หนังเป็ด'],
            'เห็ด': ['mushroom', 'เห็ด', 'golden needle mushroom', 'เห็ดเข็มทอง','เห็ดหอม', 'เห็ดหูหนูดำ', 'เห็นหูหนูขาว', 'เห็ดหลินจือ', 'เห็ดกระดุม', 'เห็นแชมปิญอง', 'เห็ดนางรม', 'เห็ดนางฟ้า', 'เห็นเป๋าฮื้อ', 'เห็ดฟาง', 'เห็ดโคน', 'เห็ดเผาะ', 'เห็ดขอนขาว', 'เห็ดยานางิ', 'เห็ดชิเมจิ'],
            'ผัก': ['bell pepper', 'พริกหยวก', 'raddish', 'หัวไชเท้า', 'spinach', 'ผักโขม', 'acacia', 'ชะอม', 'asparagus', 'หน่อไม้ฝรั่ง', 'baby corn', 'ข้าวโพดอ่อน', 'bamboo shoot', 'หน่อไม้', 'basil', 'โหระพา', 'bean sprout', 'ถั่วงอก', 'bitter been', 'สะตอ', 'bitter melon', 'มะระ', 'boy choy', 'กวางตุ้ง', 'broccoli', 'บร็อคโคลี', 'cabbage', 'กะหล่ำปลี', 'capsicum', 'carrot', 'แครอท', 'cauliflower', 'ดอกกะหล่ำ', 'celery', 'ขึ้นฉ่าย', 'chilli', 'พริก', 'ginger', 'ขิง', 'chinese cannage', 'ผักกาดขาว', 'corainder', 'ผักชี', 'cucumber', 'แตงกวา', 'egglant', 'มะเขือ', 'garlic', 'กระเทียม', 'garlic chives', 'ดอกหอม', 'ivy gourd', 'ตำลึง', 'kaffir lime', 'มะกรูด', 'kale', 'คะน้า', 'lemon grass', 'ตะไคร้', 'long bean', 'ถั่วฝักยาว', 'lotus stem', 'รากบัว', 'neem', 'สะเดา', 'onion', 'หัวหอม', 'pepper', 'พริกไทย', 'peppermint', 'สาระแหน่', 'salad vegetable', 'กรีนโอ๊ค', 'green oak', 'เรดโอ๊ค', 'red oak', 'เรดคอรัล', 'red coral', 'บัตเตอร์เฮด', 'butterhead', 'คอส', 'cos', 'ผักกาดแก้ว', 'lceberg lettuce', 'เบบี้ร็อคเก็ต', 'baby rocket', 'wild rocket', 'ไวล์ดร็อคเก็ต', 'เรดิชิโอ', 'radicchio', 'mizuna', 'มิซูน่า', 'ฟิลเลย์ไแซ์เบิร์ก', 'frillice iceberg', 'ผักกาดหอม', 'green coral', 'เคล', 'vagetable', 'sesbania grandiflora', 'ดอกแค', 'spring onion', 'ต้นหอม', 'sweet basil', 'กะเพรา', 'water spinach', 'ผักบุ้ง', 'squash', 'ฟัก'],
            'ผลไม้': ['apple','แอปเปิล', 'avocado', 'อะโวคาโด', 'banana', 'กล้วย','blueberry', 'บลูเบอร์รี', 'cantaloupe', 'แคนตาลูป', 'cherry', 'เชอร์รี', 'chinese pear', 'สาลี่', 'coconut', 'มะพร้าว', 'corn', 'ข้าวโพด', 'custard apple', 'น้อยหน่า', 'dragon fruit', 'แก้วมังกร', 'durian', 'ทุเรียน', 'grapes', 'องุ่น', 'guava', 'ฝรั่ง', 'jackfruit', 'ขนุน', 'jicama', 'แห้ว', 'kiwi', 'กีวี', 'lemon', 'เลมอน', 'longan', 'ลองกอง', 'lychee', 'ลิ้นจี่', 'mango', 'มะม่วง', 'mangosteen', 'มังคุด', 'maprang', 'มะปราง', 'melon', 'เมลอน', 'orange', 'ส้ม', 'papaya', 'มะละกอ', 'passion fruit', 'เสาวรส', 'peach', 'พีข', 'pear', 'แพร์', 'pineapple', 'สับปะรด', 'plum', 'พลัม', 'pomegranate', 'ทับทิม', 'patato', 'มันฝรั่ง', 'pumpkin', 'ฟักทอง', 'rambutan', 'เงาะ', 'rose apple', 'ชมพู่', 'salak', 'สละ', 'sapodilla', 'ละมุด', 'strawberry', 'สตรอว์เบอร์รี', 'taro', 'เผือก', 'tomato', 'มะเขือเทศ', 'watermelon','แตงโม'],
            'เครื่องดื่ม': ['cola', 'น้ำ', 'tea', 'ชา', 'soda', 'coffee', 'กาแฟ', 'juice', ' เครื่องดื่ม', 'น้ำอัดลม', 'beverages', 'beer', 'spring water', 'mineral water', 'water', 'นม', 'milk', 'coke', 'เครื่องดื่ม', 'carbonated drinks', 'protein shakes'],
            'ผลิตภัณฑ์แปรรูปจากสัตว์': ['sausage','ไส้กรอก', 'ham', 'แฮม', 'หมูยอ', 'ชีส', 'cheese', 'โบโลน่า', 'Bologna', 'ไข่แดงเค็ม', 'เต้าหู้ไข่', 'เต้าหู้', 'ทอดมัน', 'พร้อมทาน', 'แช่แข็ง', 'ออมุก'],
            'อื่น ๆ': []
        }

class_labels = ['ผลไม้', 'เนื้อสัตว์', 'ผัก','เห็ด','เครื่องดื่ม','ผลิตภัณฑ์แปรรูปจากสัตว์','อื่น ๆ']

class_details = {
    'เนื้อสัตว์': ['ไก่','วัว','เป็ด','เนื้อ','หอย','หมึก','แกะ','ปลา','กุ้ง','สันคอ', 'ซี่โครง', 'เนื้อสันนอก', 'เนื้อสันใน', 'เนื้อสะโพก', 'เนื้อน่อง', 'เนื้อติดหน้าอก', 'เนื้อติดดับขา', 'เนื้อส่วนหน้าท้อง', 'หาง', 'ปีกบน', 'น่องเล็ก', 'ปีกกลาง', 'ปีกปลาย', 'ขาไก่', 'สะโพกไก่', 'อกไก่', 'สันในไก่', 'น่องไก่', 'สะโพกไก่', 'ไก่ทั้งตัว', 'หนังไก่','ปูจั๊กจั่น', 'ปูทะเล', 'ปูแสม', 'ปูทองหลาง', 'ปูชัก', 'ปูดำ', 'ปูนา', 'ปูม้า', 'ปูทะเล', 'ปูไข่', 'ปูนิ่ม', 'ปูอลาสก้า', 'ปูขน', 'กั้ง', 'ไข่', 'ปลาสวาย', 'ปลาดุก', 'ปลาช่อน', 'ปลากระพง', 'ปลาสลิด', 'ปลาอินทรี', 'ปลาทู', 'ปลานิล', 'ปลาเก๋า', 'ปลาทับทิม', 'ปลาจะละเม็ดขาว', 'ปลาทูน่า', 'ปลาแซลม่อน', 'ปลาฉลาด', 'ปลาไหล', 'ปลาซิว', 'ปลาสำลี', 'ปลาสวาย', 'ปลากราย', 'ปลาตะเพียน', 'ปลาเนื้ออ่อน', 'ปลาหมอ', 'ตับหมู', 'หัวใจหมู', 'กระเพาะหมู', 'ปอดหมู', 'ไส้อ่อนหมู', 'ไส้ตันหมู', 'เซี้ยงจี้', 'ม้าม', 'กระเพาะวัว', 'ผ้าขี้ริ้ว', 'เลือดหมู', 'กึ๋นไก่', 'ตูดไก่', 'ตับไก่','หอยนางรม', 'หอยแมลงภู่', 'หอยแครง', 'หอยลอย', 'หอยหวาน', 'หอยหลอด', 'หอยตลับ', 'หอยเชลล์', 'หอยหมาก', 'หอยขม', 'หอยโข่ง', 'หอยเชอรี่', 'หอยเป๋าฮื้อ', 'หอยเม่น', 'หมึกล้วย', 'หมึกหอม', 'หมึกกระดอง', 'หมึกสาย', 'หมึกกระตอย', 'หมึกสาย', 'หมึกทาโกะ','กุ้งขาว', 'กุ้งแชบ๊วย', 'กุ้งโอคัก', 'กุ้งกุลาดำ', 'กุ้งลายเสือ', 'กุ้งก้ามกราม', 'กุ้งแม่น้ำ', 'กุ้งมังกร', 'กุ้งล็อบสเตอร์', 'กุ้งฝอย', 'ปีกบน', 'น่องเล็ก', 'ปีกกลาง', 'ปีกปลาย', 'ขาเป็ด', 'สะโพกเป็ด', 'อกเป็ด', 'สันในเป็ด', 'น่องเป็ด', 'สะโพกเป็ด', 'เป็ดทั้งตัว', 'หนังเป็ด'],
    'เห็ด': ['เห็ด', 'เห็ดเข็มทอง', 'เห็ดหอม', 'เห็ดหูหนูดำ', 'เห็นหูหนูขาว', 'เห็ดหลินจือ', 'เห็ดกระดุม', 'เห็นแชมปิญอง', 'เห็ดนางรม', 'เห็ดนางฟ้า', 'เห็นเป๋าฮื้อ', 'เห็ดฟาง', 'เห็ดโคน', 'เห็ดเผาะ', 'เห็ดขอนขาว', 'เห็ดยานางิ', 'เห็ดชิเมจิ'],
    'ผัก': ['หัวไชเท้า', 'ผักโขม', 'ชะอม', 'ผักกาดขาว', 'ผักชี', 'ตำลึง', 'ขึ้นฉ่าย', 'โหระพา', 'ถั่วงอก', 'สะตอ', 'มะระ', 'กวางตุ้ง', 'คะน้า', 'ตะไคร้', 'ถั่วฝักยาว', 'หน่อไม้', 'กะหล่ำปลี', 'มันฝรั่ง', 'บร็อคโคลี', 'ผักกาดแก้ว', 'เห็ดนางรม', 'มิซูน่า', 'กรีนโอ๊ค', 'เรดโอ๊ค', 'เรดคอรัล', 'บัตเตอร์เฮด', 'คอส', 'เคล', 'ดอกหอม', 'ต้นหอม', 'เผือก', 'มะเขือเทศ'],
    'ผลไม้': ['แอปเปิล', 'อะโวคาโด', 'กล้วย', 'บลูเบอร์รี', 'แคนตาลูป', 'เชอร์รี', 'สาลี่', 'มะพร้าว', 'ข้าวโพด', 'น้อยหน่า', 'แก้วมังกร', 'ทุเรียน', 'องุ่น', 'ฝรั่ง', 'ขนุน', 'แห้ว', 'กีวี', 'เลมอน', 'ลองกอง', 'ลิ้นจี่', 'มะม่วง', 'มังคุด', 'มะปราง', 'เมลอน', 'ส้ม', 'มะละกอ', 'เสาวรส', 'พีข', 'แพร์', 'สับปะรด', 'พลัม', 'ทับทิม', 'มันฝรั่ง', 'ฟักทอง', 'เงาะ', 'ชมพู่', 'สละ', 'ละมุด', 'สตรอว์เบอร์รี', 'เผือก', 'มะเขือเทศ', 'แตงโม'],
    'เครื่องดื่ม': ['น้ำ', 'ชา', 'กาแฟ', ' เครื่องดื่ม', 'น้ำอัดลม', 'นม', 'เครื่องดื่ม'],
    'ผลิตภัณฑ์แปรรูปจากสัตว์': ['ไส้กรอก', 'แฮม', 'หมูยอ', 'ชีส', 'โบโลน่า', 'ไข่แดงเค็ม', 'เต้าหู้ไข่', 'เต้าหู้', 'ทอดมัน', 'พร้อมทาน', 'แช่แข็ง', 'ออมุก'],
    'อื่น ๆ': []
}

class_unit ={
    'เนื้อสัตว์' : ['กรัม'],
    'ผัก' : ['กรัม'],
    'ผลไม้' : ['กรัม'],
    'อื่น ๆ': []
}


class_labels_meat = ['OtherMeats and Mushroom', 'Poultry', 'Seafood']
meat_groups = {
    'Poultry': ['chicken (ไก่)', 'duck (เป็ด)'],
    'Seafood': ['crab (ปู)', 'crayfish (กุ้ง)', 'fish (ปลา)', 'shellfish (หอย)', 'shrimp (กุ้ง)', 'squid (ปลาหมึก)'],
    'OtherMeats and Mushroom': ['beef (เนื้อวัว)', 'egg (ไข่)', 'lamb (เนื้อแกะ)', 'mushroom (เห็ดต่าง ๆ)', 'offal (เครื้องใน)', 'pork (เนื้อหมู)', 'Golden needle mushroom (เห็ดเข็มทอง)']
}


class_labels_fruit = ['Green and Brown Fruits','Red and Blue Fruits','Yellow and Orange Fruits']
fruit_groups = {
    'Green and Brown Fruits': ['Taro (เผือก)', 'Kiwi (กีวี)', 'Avocado (อะโวคาโด)', 'Coconut (มะพร้าว)', 'Sapodilla (ละมุด)', 'Potato (มันฝรั่ง)', 'Guava (ฝรั่ง)', 'Custard apple (น้อยหน่า)', 'Melon (เมล่อน)', 'Longan (ลำไยและลองกอง)'],
    'Red and Blue Fruits': ['Tomato (มะเขือเทศ)', 'Dragon fruit (แก้วมังกร)', 'Grapes (องุ่น)', 'Rambutan (เงาะ)', 'Lychee (ลิ้นจี่)', 'Peach (พีช)', 'Plum (ลุกพลัม)', 'Cherry (เชอร์รี่)', 'Salak (สละ)', 'Apple (แอปเปิ้ล)', 'Blueberry (บลูเบอร์รี)', 'Pomegranate (ทับทิม)', 'Passion fruit (เสาวรส)', 'Watermelon (แตงโม)', 'Mangosteen (ชมพู่)', 'Strawberry (สตรอว์เบอรี่)', 'Rose apple (ชมพู่)'],
    'Yellow and Orange Fruits': ['Lemon (เลมอน)', 'Orange (ส้ม)', 'Chinese pear (สาลี่)', 'Jicama (มันแกว)', 'Durian (ทุเรียน)', 'Banana (กล้วย)', 'Pumpkin (ฟักทอง)', 'Pineapple (สับปะรด)', 'Maprang (มะปราง)', 'Mango (มะม่วง)', 'Corn (ข้าวโพด)', 'Pear (ลูกแพร)', 'Jackfruit (ขนุน)', 'Papaya (มะละกอ)', 'Cantaloupe (แคนตาลูป)'],
    
}

class_labels_vegetable = ['Green vegetables','Red and orange vegetables','White and light-colored vegetables']
vegetable_groups = {
    'Green vegetables': ['Basil (โหระพา)', 'Spring onion (ต้นหอม)', 'Pepper (พริกไทย)', 'Coriander (ผักชี)', 'Lemon grass (ตะไคร้)', 'Ivy gourd (ตำลึง)', 'Sweet basil (กะเพรา)', 'Water spinach (ผักบุ้ง)', 'Acacia (ชะอม)', 'Long beans (ถั่วฝักยาว)', 'Spinach (ผักโขม)', 'Broccoli (บรอคโคลี)', 'Kaffir lime (มะกรูด)', 'Peppermint (สะระแหน่)', 'Chinese cabbage (ผักบุ้ง)', 'Cucumber (ผักกาดขาว)', 'Kale (คะน้า)' , 'Salad vegetables (ผักสลัด)', 'Cabbage (กะหล่ำปลี)', 'Bitter melon (มะระ)', 'Asparagus (หน่อไม้ฝรั่ง)', 'Squash (ฟัก)', 'Neem (สะเดา)', 'Eggplant (มะเขือ)', 'Bitter bean (สะตอ)', 'Celery (ขึ้นฉ่าย)', 'Bok choy (กวางตุ้ง)', 'Garlic chives (ต้นหอม)'],
    'Red and orange vegetables': ['Onion (หัวหอม)', 'Carrot (แครอท)', 'Chilli pepper (พริก)', 'Capsicum (พริกหยวก)', 'Bell pepper (พริกสามสี)'],
    'White and light-colored vegetables': ['Bamboo shoot (หน่อไม้)', 'Ginger (ขิง)', 'Cauliflower (กะหล่ำดอก)', 'Lotus stem (รากบัว)', 'Baby corn (ข้าวโพดอ่อน)', 'Bean sprout (ถั่วงอก)', 'Raddish (หัวไชเท้า)', 'Garlic (กระเทียม)', 'Sesbania grandiflora (ดอกแค)'],
    }







# class_labels_meat = ['เห็ดและอื่น ๆ ', 'สัตว์ปีก', 'อาหารทะเล']
# meat_groups = {
#     'สัตว์ปีก': ['ไก่', 'เป็ด'],
#     'อาหารทะเล': ['ปู', 'กุ้ง', 'ปลา', 'หอย', 'ปลาหมึก'],
#     'อื่น ๆ และเห็ด': ['เนื้อวัว', 'ไข่', 'เนื้อแกะ', 'เห็ด', 'เครื่องใน', 'เนื้อหมู', 'เห็ดเข็มทอง']
# }

# class_labels_fruit = ['ผลไม้โทนสีเขียวและสีน้ำตาล', 'ผลไม้โทนสีแดงและสีน้ำเงิน', 'ผลไม้โทนสีเหลืองและสีส้ม']
# fruit_groups = {
# 'ผลไม้โทนสีเขียวและสีน้ำตาล': ['เผือก', 'กีวี', 'อะโวคาโด', 'มะพร้าว', 'ละมุด', 'มันฝรั่ง', 'ฝรั่ง', 'น้อยหน่า', 'เมล่อน', 'ลำไยและลองกอง'],
# 'ผลไม้โทนสีแดงและสีน้ำเงิน': ['มะเขือเทศ', 'แก้วมังกร', 'องุ่น', 'เงาะ', 'ลิ้นจี่', 'พีช', 'ลุกพลัม', 'เชอร์รี่', 'สละ', 'แอปเปิ้ล', 'บลูเบอร์รี', 'ทับทิม', 'แตงโม', 'เสาวรส', 'สตรอว์เบอรี่', 'ชมพู่','มังคุด'],
# 'ผลไม้โทนสีเหลืองและสีส้ม': ['เลมอน', 'ส้ม', 'สาลี่', 'มันแกว', 'ทุเรียน', 'กล้วย', 'ฟักทอง', 'สับปะรด', 'มะปราง', 'มะม่วง', 'ข้าวโพด', 'ลูกแพร', 'ขนุน', 'มะละกอ', 'แคนตาลูป']
# }


# class_labels_vegetable = ['ผักโทนสีเขียว', 'ผักโทนสีแดงและสีส้ม', 'ผักโทนสีสว่าง']
# vegetable_groups = {
# 'ผักโทนสีเขียว': ['โหระพา', 'ต้นหอม', 'พริกไทย', 'ผักชี', 'ตะไคร้', 'ตำลึง', 'กะเพรา', 'ผักบุ้ง', 'ชะอม', 'ถั่วฝักยาว', 'ผักโขม', 'บรอคโคลี', 'มะกรูด', 'สะระแหน่', 'ผักบุ้ง', 'ผักกาดขาว', 'แตงกวา','คะน้า', 'ผักสลัด', 'กะหล่ำปลี', 'มะระ', 'หน่อไม้ฝรั่ง', 'ฟัก', 'สะเดา','มะเขือยาว', 'มะเขือ', 'สะตอ', 'ขึ้นฉ่าย', 'กวางตุ้ง','ดอกหอม'],
# 'ผักโทนสีแดงและสีส้ม': ['หัวหอม', 'แครอท', 'พริก', 'พริกหยวก', 'พริกสามสี'],
# 'ผักโทนสีสว่าง': ['หน่อไม้', 'ขิง', 'กะหล่ำดอก', 'รากบัว', 'ข้าวโพดอ่อน', 'ถั่วงอก', 'หัวไชเท้า', 'กระเทียม', 'ดอกแค'] # Adjusted the translations based on the context
# }

