subcategories_keywords = {
    'เนื้อสัตว์': {
        'วัว': ['วัว'],
        'ไก่': ['ไก่'],
        'ปู': ['ปู'],
        'กั้ง': ['กั้ง'],
        'ไข่': ['ไข่'],
        'ปลา': ['ปลา'],
        'แกะ': ['แกะ'],
        'เครื่องใน': ['เครื่องใน'],
        'หมู': ['หมู'],
        'หอย': ['หอย'],
        'เป็ด': ['เป็ด'],
        'หมึก': ['หมึก'],
        'กุ้ง': ['กุ้ง'],
    },
    'ผัก': {
        'พริก': ['พริก'],
        'กระเทียม': ['กระเทียม'],
        'ชะอม': ['ชะอม'],
        'มะระ': ['มะระ']
    },
    'ผลไม้': {
        'แตงโม': ['แตงโม'],
        'ส้ม': ['ส้ม'],
        'เชอร์รี': ['เชอร์รี'],
        'ขนุน': ['ขนุน']
    },
        'ผลิตภัณฑ์แปรรูปจากสัตว์': {
        'ไส้กรอก': ['ไส้กรอก'],

    },
    # Add more categories and subcategories as needed
}
